emacs/litinit.org
#+TITLE: Emacs Configuration and Documentation
#+startup: overview
#+PROPERTY: header-args:emacs-lisp :tangle ~/.config/emacs/init.el
* TODO Aesthetics
** TODO Theme Selection and UI toggles
  :PROPERTIES:
  :ID:       ef50006f-dbbb-4800-bebf-2f834b122c7f
  :END:
  #+begin_src emacs-lisp
    (load-theme 'doom-dark+ t)
    (menu-bar-mode -1)
    (toggle-scroll-bar -1)
    (tool-bar-mode -1)
    (setq inhibit-startup-screen t)
  #+end_src
  No startup screen. Remove GUI menus, scrollbar, etc. Use doom-dark+ theme
*** TODO adjust "dull" color face for comments/done items
*** TODO enable better tracking of line and column number
** TODO customize startup screen
*** TODO show agenda on startup
*** TODO show perspective switcher on startup
* TODO Emacs Foundations
** DONE Package Management
   :PROPERTIES:
   :ID:       84ecd110-a05a-48f9-815c-bb2d78dacc45
   :END:
   :STATUSLOG:
   - State "DONE"       from "TODO"       [2021-09-12 Sun 16:59]
   :END:
   #+begin_src emacs-lisp
     (require 'package)
	  (add-to-list 'package-archives
		       '("melpa" . "https://melpa.org/packages/") t)
	  (package-initialize)
     (when (not (package-installed-p 'use-package))
       (package-refresh-contents)
       (package-install 'use-package))     
   #+end_src
   use melpa package repository with package.el
   Ensure Use-Package macro is installed.
   It enables init portability and directive-based protocol for concise configuration
** TODO Backups and Recovery
  :PROPERTIES:
  :ID:       e80c641b-fc4a-4762-bbaf-0be12fbd84f3
  :END:
  #+begin_src emacs-lisp
    ;; (desktop-save-mode 1) ;; recover frame between sessions -- OBSOLETE, save/load perspectives instead
    (winner-mode 1) 
    (setq backup-directory-alist '(("." . "~/.local/share/emacs/saves/")))
    (setq backup-by-copying t ;; backup by copying to preserve symlinked files and creation times
	  version-control t ;; number versions unconditionally
	  delete-old-versions t
	  kept-new-versions 6 ;; keep 6 versions from the current session
	  kept-old-versions 2) ;; keep 2 versions from past sessions
    (setq auto-save-default t ;; auto save every buffer that visits a file
	  auto-save-timeout 60 ;; default autosave on 30 second idle
	  auto-save-interval 200) ;; default autosave every 300 keystrokes
  #+end_src
  1. activate minor modes to aid in session recovery
  2. save backups in centralized directory
     - backups in a long!file!name format (255 byte limit on ext4)
       - format replaces path separators with !
  3. Saving regularly is enough to avoid #autosave# creation.
     notice: they can cause directory-crawling scripts to fail.
*** TODO pm/restore-this-buffer/file-from-backup
    A function that can parse the saves directory and recover from a backup
    (multiple numbered versions possible) for the current file should be found/created
*** TODO sensitive-mode/minor-mode
    Limits autosave and backup for sensitive files like gpg keys so there's no un-encrypted copies
*** TODO manage session recovery using persp and projectile
    :PROPERTIES:
    :ID:       95b10f12-2088-435c-a3aa-1db3880ec0ac
    :END:
    Perspectives include files and defined frame configurations
    set up startup screen to show unexpectedly quit perspectives in a subsection?
** TODO Enable, Empower, Automate mode activations
    :PROPERTIES:
    :ID:       51b5345d-67c9-48ef-b749-4ade381c2a36
    :END:
   #+begin_src emacs-lisp
     (load "~/.config/emacs/my-alias.el") ;; load aliases making some commands into other commands, or shortcuts
     (setq-default abbrev-mode t) ;; universally expand abbreviations and make new ones dynamically
     (setq save-abbrevs 'silently)
     ;; (setq auto-mode-alist
     ;;       (append
     ;;        (list '("\\.\\(vcf\\|gpg\\)$" . sensitive-minor-mode))
     ;;        auto-mode-alist))
   #+end_src
   auto-mode-alist is used to activate modes according to file extension.
   it is very well defined. only append cons cells of regexp extensions and associated mode(s)
*** TODO automate recognition of sensitive file types
    waiting on sensitive mode installation (see bookmarks)
* TODO dired mode
  :PROPERTIES:
  :ID:       3d554912-ac86-4ca1-8723-220fe537b110
  :END:
     #+begin_src emacs-lisp
    (use-package dired
      :init
      (setq dired-auto-revert-buffer t)  ;; don't prompt to revert; just do it
      (setq dired-dwim-target t)  ;; suggest a target for moving/copying intelligently
      (setq dired-hide-details-hide-symlink-targets nil)
    ;; Always copy/delete recursively
      (setq dired-recursive-copies 'always)
      (setq dired-recursive-deletes 'top)
    ;; Where to store image caches
    ;;        image-dired-dir (concat doom-cache-dir "image-dired/")
    ;;        image-dired-db-file (concat image-dired-dir "db.el")
    ;;        image-dired-gallery-dir (concat image-dired-dir "gallery/")
    ;;        image-dired-temp-image-file (concat image-dired-dir "temp-image")
    ;;        image-dired-temp-rotate-image-file (concat image-dired-dir "temp-rotate-image")
    ;; Screens are larger nowadays, we can afford slightly larger thumbnails
    ;;        image-dired-thumb-size 150)
      :config
      ;; cool thumbnails
    ;;  (set-popup-rule! "^\\*image-dired"
    ;;    :slot 20 :size 0.8 :select t :quit nil :ttl 0)
    ;;  (set-evil-initial-state! 'image-dired-display-image-mode 'emacs)
      (let ((args (list "-ahl" "-v" "--group-directories-first"))))
    ;;dealing with extenuating circumstances in remote sessions
    ;;    (add-hook! 'dired-mode-hook 
    ;;      (defun pm/dired-disable-gnu-ls-flags-in-tramp-buffers-h ()
    ;;        "Fix #1703: dired over TRAMP displays a blank screen.
    ;;
    ;;This is because there's no guarantee the remote system has GNU ls, which is the
    ;;only variant that supports --group-directories-first."
    ;;        (when (file-remote-p default-directory)
    ;;          (setq-local dired-actual-switches (car args))))))
     
      ;; Don't complain about this command being disabled
    ;;  (put 'dired-find-alternate-file 'disabled nil)
      :bind (:map dired-mode-map
		  (("C-c C-e" . wdired-change-to-wdired-mode)))) ;; To be consistent with ivy and wgrep integration
  #+end_src
** TODO dired as a file manager
*** TODO display thumbnails
*** TODO file/directory ordering
*** INACTIVE install discover/discover-my-major for dired
* TODO company mode
  :PROPERTIES:
  :ID:       8adb25c3-de90-4f62-ae57-f6f3cf3505ba
  :END:
  #+begin_src emacs-lisp
    (use-package company
      :ensure t
      :config
      (global-company-mode))
  #+end_src
  all purpose backend for on-the-fly code and text completion  
* TODO Org-mode
** DONE Automatically Tangle Configuration
    :PROPERTIES:
    :ID:       88bbb14f-2679-47a5-a7b6-e2b45d7a2503
    :END:
    :STATUSLOG:
    - State "DONE"       from              [2021-09-12 Sun 12:25]
    :END:
    tangle litinit.org to init.el when saving this file.
    #+begin_src emacs-lisp
      (defun pm/org-babel-tangle-config ()
	(when (equal (buffer-file-name)
		     (expand-file-name "~/.config/emacs/litinit.org"))
	  (let ((org-confirm-babel-evaluate nil))
	    (org-babel-tangle))))
     
      (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'pm/org-babel-tangle-config)))
    #+end_src
*** psudo defun:
    if full path to litinit is current buffer, then do not confirm
    evaluation and tangle file.  Hooked to saving in org-mode
** TODO Org(
   :PROPERTIES:
   :ID:       7e51f71f-4166-40f4-8701-cea7edf58451
   :END:
   Org depends on a central filesystem, heading keywords, various triggers, definitions and more.
   additionally, the appearance of certain faces, drawers, and modes are configured.
   finally certain organization tools are given default definitions or behaviors to aid with my chosen workflow
   #+begin_src emacs-lisp
     (use-package org
       :ensure t
       :config
       (setq org-ellipsis " [+]") ;; Custom fold indicator because I often use ellipses and it's confusing
       (custom-set-faces '(org-ellipsis ((t (:foreground "gray40" :underline nil))))) ;; using custom -- consider editing theme?
       (setq org-directory (concat (getenv "HOME") "/org"))
       (setq org-use-fast-todo-selection 'auto) ;; present keyword hotkeys to user if available
       (setq org-treat-S-cursor-todo-selection-as-state-change nil) ;; cycle keywords without state logging using S-left\right
       (setq org-todo-keywords ;; set to timestamp deliberate state changes
	     '((sequence "TODO(t)"
			 "NEXT(n!)"
			 "WAIT(w@/!)"      
			 "|"	          
			 "DONE(d!)"        
			 "INACTIVE(i@)"    
			 "CANCELED(q@/@)") 	                                   
	       (sequence "JOURNAL(j!)"     
			 "CONTACT(c!)"     
			 "MEETING(m!)"     
			 "|")))
       ;;        (sequence "REPORT" "BUG" "KNOWNCAUSE" "|" "FIXED"))) ;; development task labels
       (setq org-todo-keyword-faces
	     (quote (("TODO" :foreground "blue" :weight bold)
		     ("NEXT" :foreground "red" :weight bold)
		     ("WAIT" :foreground "orange" :weight bold)
		     ("DONE" :foreground "forest green" :weight bold)
		     ("INACTIVE" :foreground "magenta" :weight bold)
		     ("CANCELED" :foreground "forest green" :weight bold)
		     ("JOURNAL" :foreground "white" :weight bold)
		     ("CONTACT" :foreground "white" :weight bold)
		     ("MEETING" :foreground "white" :weight bold))))
       (setq org-enforce-todo-dependencies t)
       (setq org-agenda-dim-blocked-tasks t) ;; try this on for size -- only effects agenda view
       (setq org-log-into-drawer "STATUSLOG") ;; hide state change history in drawer under headlines
       (setq org-priority-default 3) ;; strictly options for sorting the agenda
       (setq org-priority-highest 1)
       (setq org-priority-lowest 5)
   #+end_src
   consolidate automated .org files (captures, project categories, project logs, archives; contacts, zettles, bibliography) under ~/org.
*** INACTIVE Create keywords for common specific workflows
    like the commented dev maintainance workflow?
*** TODO develop filesystem
    this depends on how best to take literature notes in large part...
    desires: take zettles while reading, combine reading pdfs and notes in interleaving fashion?
