emacs/init.el
(load-theme 'doom-dark+ t)
(menu-bar-mode -1)
(toggle-scroll-bar -1)
(tool-bar-mode -1)
(setq inhibit-startup-screen t)

(require 'package)
     (add-to-list 'package-archives
		  '("melpa" . "https://melpa.org/packages/") t)
     (package-initialize)
(when (not (package-installed-p 'use-package))
  (package-refresh-contents)
  (package-install 'use-package))

;; (desktop-save-mode 1) ;; recover frame between sessions -- OBSOLETE, save/load perspectives instead
(winner-mode 1) 
(setq backup-directory-alist '(("." . "~/.local/share/emacs/saves/")))
(setq backup-by-copying t ;; backup by copying to preserve symlinked files and creation times
      version-control t ;; number versions unconditionally
      delete-old-versions t
      kept-new-versions 6 ;; keep 6 versions from the current session
      kept-old-versions 2) ;; keep 2 versions from past sessions
(setq auto-save-default t ;; auto save every buffer that visits a file
      auto-save-timeout 60 ;; default autosave on 30 second idle
      auto-save-interval 200) ;; default autosave every 300 keystrokes

(load "~/.config/emacs/my-alias.el") ;; load aliases making some commands into other commands, or shortcuts
(setq-default abbrev-mode t) ;; universally expand abbreviations and make new ones dynamically
(setq save-abbrevs 'silently)
;; (setq auto-mode-alist
;;       (append
;;        (list '("\\.\\(vcf\\|gpg\\)$" . sensitive-minor-mode))
;;        auto-mode-alist))

(use-package dired
  :init
  (setq dired-auto-revert-buffer t)  ;; don't prompt to revert; just do it
  (setq dired-dwim-target t)  ;; suggest a target for moving/copying intelligently
  (setq dired-hide-details-hide-symlink-targets nil)
;; Always copy/delete recursively
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'top)
;; Where to store image caches
;;        image-dired-dir (concat doom-cache-dir "image-dired/")
;;        image-dired-db-file (concat image-dired-dir "db.el")
;;        image-dired-gallery-dir (concat image-dired-dir "gallery/")
;;        image-dired-temp-image-file (concat image-dired-dir "temp-image")
;;        image-dired-temp-rotate-image-file (concat image-dired-dir "temp-rotate-image")
;; Screens are larger nowadays, we can afford slightly larger thumbnails
;;        image-dired-thumb-size 150)
  :config
  ;; cool thumbnails
;;  (set-popup-rule! "^\\*image-dired"
;;    :slot 20 :size 0.8 :select t :quit nil :ttl 0)
;;  (set-evil-initial-state! 'image-dired-display-image-mode 'emacs)
  (let ((args (list "-ahl" "-v" "--group-directories-first"))))
;;dealing with extenuating circumstances in remote sessions
;;    (add-hook! 'dired-mode-hook 
;;      (defun pm/dired-disable-gnu-ls-flags-in-tramp-buffers-h ()
;;        "Fix #1703: dired over TRAMP displays a blank screen.
;;
;;This is because there's no guarantee the remote system has GNU ls, which is the
;;only variant that supports --group-directories-first."
;;        (when (file-remote-p default-directory)
;;          (setq-local dired-actual-switches (car args))))))

  ;; Don't complain about this command being disabled
;;  (put 'dired-find-alternate-file 'disabled nil)
  :bind (:map dired-mode-map
	      (("C-c C-e" . wdired-change-to-wdired-mode)))) ;; To be consistent with ivy and wgrep integration

(use-package company
  :ensure t
  :config
  (global-company-mode))

(defun pm/org-babel-tangle-config ()
  (when (equal (buffer-file-name)
	       (expand-file-name "~/.config/emacs/litinit.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'pm/org-babel-tangle-config)))

(use-package org
  :ensure t
  :config
  (setq org-ellipsis " [+]") ;; Custom fold indicator because I often use ellipses and it's confusing
  (custom-set-faces '(org-ellipsis ((t (:foreground "gray40" :underline nil))))) ;; using custom -- consider editing theme?
  (setq org-directory (concat (getenv "HOME") "/org"))
  (setq org-use-fast-todo-selection 'auto) ;; present keyword hotkeys to user if available
  (setq org-treat-S-cursor-todo-selection-as-state-change nil) ;; cycle keywords without state logging using S-left\right
  (setq org-todo-keywords ;; set to timestamp deliberate state changes
	'((sequence "TODO(t)"
		    "NEXT(n!)"
		    "WAIT(w@/!)"      
		    "|"	          
		    "DONE(d!)"        
		    "INACTIVE(i@)"    
		    "CANCELED(q@/@)") 	                                   
	  (sequence "JOURNAL(j!)"     
		    "CONTACT(c!)"     
		    "MEETING(m!)"     
		    "|")))
  ;;        (sequence "REPORT" "BUG" "KNOWNCAUSE" "|" "FIXED"))) ;; development task labels
  (setq org-todo-keyword-faces
	(quote (("TODO" :foreground "blue" :weight bold)
		("NEXT" :foreground "red" :weight bold)
		("WAIT" :foreground "orange" :weight bold)
		("DONE" :foreground "forest green" :weight bold)
		("INACTIVE" :foreground "magenta" :weight bold)
		("CANCELED" :foreground "forest green" :weight bold)
		("JOURNAL" :foreground "white" :weight bold)
		("CONTACT" :foreground "white" :weight bold)
		("MEETING" :foreground "white" :weight bold))))
  (setq org-enforce-todo-dependencies t)
  (setq org-agenda-dim-blocked-tasks t) ;; try this on for size -- only effects agenda view
  (setq org-log-into-drawer "STATUSLOG") ;; hide state change history in drawer under headlines
  (setq org-priority-default 3) ;; strictly options for sorting the agenda
  (setq org-priority-highest 1)
  (setq org-priority-lowest 5)
