emacs/litinit.org
*** GTD Philosophy
    clearly label actionables with some conveniences for tracking state changes over a project's history:

    keywords designed for use with hierarchically nested task-trees:
    - TODO any task to appear in the agenda. Any TODO heading with subheadings is a project. 
    - NEXT a priority task in an ongoing project -- a project with no NEXT is stuck (log time on)
      - also, NEXT is a catch-all for immediate actions: reply to, forward mail, return phone call, establish meeting, etc
    - WAIT any task requiring action from others before proceeding (log note on, time off)
    - DONE any completed task that stands only to be archived (log time on)
    - INACTIVE a project that is not prioritized -- cant be stuck (log note on)
    - CANCELED an aborted project that stands only to be archived (log note on, note off)			  

    hierarchically nested todos imply parents are dependent on children, sometimes siblings. So ORDERED property is assigned and enforced.
    overrule using NOBLOCKING property.
    
    captures documenting unplanned workaday occurrences as org trees can be balled with keywords too.
    - JOURNAL specific notes relevant to ongoing project. Journal entries should end up in reports (log time on)  
    - CONTACT add to professional address book and Contact/Customer Relationship Management (CRM) (log time on)
    - MEETING for any and all meetings, specific capture templates optional (log time on)                            
    perhaps category properties or tags are better -- but they lack the convenient time stamping
*** INACTIVE Configure universal properties?
**** INACTIVE universal tags?
     ":STUDY:EMAIL:PERSONAL:PURCHASE:GROUP: -> org-tag-alist" for project assignment
     alternatively, fast meta-linking with org-tag-persistent-alist + file specific tagging -- OR configure org-complete-tags-always-offer-all-agenda-tags
**** INACTIVE Universal categories?
     do project assignment with category property? leaves tags free for meta-linking?
     tags management by C-c C-q and C-c C-c is fast -- better for on the fly connections... But this is more important for notes which are handled by roam anyway.
** TODO Org filesystem
   :PROPERTIES:
   :ID:       4827b3ea-dff2-413b-a136-6312fe665208
   :END:
   #+begin_src emacs-lisp
     (setq org-default-notes-file (concat org-directory "/refile.org")) ;; org-capture file -- compiles capture entries (all entries tagged :refile)     
     ;; default cabinets for refiling outstanding captures + organized sources populating org-agenda.
     (setq org-cabinets (list (concat org-directory "/logbook.org") ;; datetree chronicling clocktime, timestamped captures, with journal entries
			      (concat org-directory "/research.org") ;; my research, school, and study -- to be populated explicitly by capturing
			      (concat org-directory "/addressbook.org"))) ;; CRM file. Network contacts by linking manually (so it sticks), use roam
   #+end_src
*** TODO include all zettles?
    why not? perhaps to keep tags distinct? Or be more meticulous, and use hierarchies to make tags more orderly+specific w/ regexp?
     to-do items often arise while taking notes, so capturing can deal with that, but having the full context of the emergence is useful...
     I need a system of zettlekasten that can push in-topic todos to the agenda. Even if those todos are just tangents of study to be perused!
*** TODO Set up archive file? or archive siblings?
    what is this? how does it work with the logbook datetree intention?
*** TODO diary or bbdb/CRM?
    for tabbing anniversaries, holidays, events? or instead, use bbdb integration?
*** TODO make this init.el literate
**** TODO use it as a cabinet
     massively improves ability to track environment development developments
** TODO Org-Agenda
   :PROPERTIES:
   :ID:       512d28ed-857b-4f26-93e8-a4e22ec4f1e1
   :END:
   #+begin_src emacs-lisp
     ;; org-agenda
     (setq org-agenda-files (cons org-default-notes-file org-cabinets)) ;; populate agenda from cabinets + refile.org
     (setq org-agenda-skip-scheduled-if-deadline-is-shown t) ;; show only deadline on or after day deadlining task is scheduled
     (setq org-agenda-span 'week) ;; show week view by default
     (setq org-agenda-start-day "-0d") ;; start at today by default (in org-read-date input form)
     (setq org-agenda-start-on-weekday nil) ;; weekly overview starts today and looks forward, leave the past be.
     ;; tags/TODO filters (see tag and property searches) for agenda organization:
     (setq org-stuck-projects 
	   '("+LEVEL=1+TODO/-DONE-CANCELED-INACTIVE-NEXT" ("NEXT")))
     ;; Use the current window for indirect buffer display
     (setq org-indirect-buffer-display 'current-window)
   #+end_src
   fresh captures appear in the agenda. The ability to adjust org-agenda-files on the fly with C-c C-] is preserved.
*** Configuring returns of Agenda search queries
    (setq org-tags-match-list-sublevels nil) will ensure headings
    matched by tag/property searches carry don't carry subheadings to
    the agenda However, this is not recommended. Instead, for getting
    only top level tasks matched by tag filters, configure tag
    inheritance or define filters if this is a problem
** TODO Org task timing, tracking and reporting
   :PROPERTIES:
   :ID:       3c1ad362-1b03-4b15-91d9-3f3ed6f67c87
   :END:
   #+begin_src emacs-lisp
     (setq org-columns-default-format
	   "%TODO %2PRIORITY %25ITEM(Task) %10Effort(Est_Effort){est+} %CLOCKSUM %CLOCKSUM_T")
     (org-clock-persistence-insinuate) ;; set up hooks for clock persistence through sessions
     (setq org-clock-persist t) ;; continue any running clock when emacs exits. Also save all set clock history accross sessions.
     (setq org-clock-idle-time 10) ;; and prompt to resolve running clocks when restarting, or after 10 minutes of emacs idle time.     
   #+end_src
   default column view of task properties aids in rapid assessment of time investment and difficulty. individual files/headings may define different views locally.
*** TODO project planning
    especially for modern collaborative endeavors, estimating effort and tracking progress against expectations is critical.
    configure effort estimation for project management. in the meantime, update effort estimates for running clocks with ‘C-c C-x C-e’
** TODO Org-Capture
   :PROPERTIES:
   :ID:       f93153be-7354-4160-bc7e-011ec1af3241
   :END:
   #+begin_src emacs-lisp
     (setq org-capture-templates
	   (quote (("p" "project outlining and reporting") ;; new project definitions and reports on predefined projects
		   ("pt" "todo" entry (file "~/org/refile.org") ;; a new task needing to be defined and inserted into ongoing project
		    "* TODO %?\n%U\n%a\n")
		   ("ps" "todo" entry (file "~/org/refile.org") ;; schedule a new event.
		    "* TODO %?\n%^T")
		   ;; template current time, link in ring (or current file), capture new task name, pause other clocks, clock time, resume other clocks
		   ;; ex :: good for a job in any given piece of code because it links to the line that inspired it.
		   ;;		("pr" "reflect" entry (file "~/org/refile.org")
		   ;;		 "* JOURNAL")
		   ;; OR
		   ;;		("n" "note" entry (file "~/org/refile.org")
		   ;;               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
		   ;; not sure what this looks like yet. On-the-clock thoughts about current work (look at %k), look at organizing by :tag
		   ("i" "interruptions")
		   ("ir" "respond" entry (file "~/org/refile.org")
		    "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
		   ;; fully automated reaction cache for differed inquiries, requests, solicitations, etc.
		   ("ii" "idea" entry (file "~/org/refile.org")
		    "* INACTIVE")
		   ;; for academic questions, topics of investigation, project proposals, paper subject.
		   ;;		("w" "org-protocol" entry (file "~/org/refile.org")
		   ;;		 "* TODO Review %c\n%U\n" :immediate-finish t)
		   ;; tracking org workflow and planning adaptations TAG = :ENV?
		   ("m" "Meeting" entry (file "~/org/refile.org")
		    "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
		   ;; documenting essentials of scheduled and spontaneous meetings/encounters.
		   ("c" "CONTACT" entry (file "~/org/refile.org") ;; document professional contact
		    "* CONTACT"))))
     (defun pm/remove-empty-drawer-on-clock-out ()
       "Remove empty STATUSLOG drawers on clock out, use as hook to de-clutter ephemeral captures"
       (interactive)
       (save-excursion
	 (beginning-of-line 0)
	 (org-remove-empty-drawer-at "STATUSLOG" (point))))
     (add-hook 'org-clock-out-hook 'pm/remove-empty-drawer-on-clock-out 'append)     
   #+end_src
   Captures are for documenting immediate items that need to be ordered into existing and time-sensitive workflows.
   Notes from classes, research, reasoning, etc. are handled in the Zettlekasten method using org-roam, configured later.
*** DONE Declutter rapid captures
    delete short clock-ins activated on clocked captures. clocking by
    attention is convenint for continuous productivity logging, but
    occasional 30 second clocks are neurotic
**** psudo defun:
     if clockline is less than a minute, delete "statuslog"
** TODO Org-Refile
   :PROPERTIES:
   :ID:       79c2e923-7f67-4b0d-bd1a-cadcaf5f7ebb
   :END:
   #+begin_src emacs-lisp
     ;; refile targets include any file contributing to the agenda - up to 9 levels deep
     (setq org-refile-targets '((org-agenda-files :maxlevel . 9)))
     ;; Use full outline paths for refile targets - file directly into agenda position using Ivy
     (setq org-refile-use-outline-path t)
     ;; Targets complete directly with Ivy, org need not assist
     (setq org-outline-path-complete-in-steps nil)
     ;; Allow refile to create parent tasks with confirmation
     (setq org-refile-allow-creating-parent-nodes 'confirm)
     (defun pm/verify-refile-target ()
       "Exclude todo keywords with a done state from refile targets"
     (not (member (nth 4 (org-heading-components)) org-done-keywords)))
     (setq org-refile-target-verify-function 'pm/verify-refile-target)
   #+end_src
*** TODO ivy for refiling headings
    no idea where to start
*** DONE Tag all headings in refile.org with refile
    use local file properties
*** DONE Do not refile done items
    if something was captured for record but ends up getting done fast, mark done, move on, purge whenever's good
    make filter function
    assign to org-refile-target-verify-function
**** psudo defun:
     if todo-keyword in current heading is not a member of the done-keywords, provide nil, else provide t
** TODO Org for academic reading, writing, and reproducible research
   lots of possibilities. Learn more. take notes. Prepare to keep
   bibliography (consider centralized bibliography, where citations
   are made on basis of inclusion in paper)
