emacs/init.el

(setq org-default-notes-file (concat org-directory "/refile.org")) ;; org-capture file -- compiles capture entries (all entries tagged :refile)     
;; default cabinets for refiling outstanding captures + organized sources populating org-agenda.
(setq org-cabinets (list (concat org-directory "/logbook.org") ;; datetree chronicling clocktime, timestamped captures, with journal entries
			 (concat org-directory "/research.org") ;; my research, school, and study -- to be populated explicitly by capturing
			 (concat org-directory "/addressbook.org"))) ;; CRM file. Network contacts by linking manually (so it sticks), use roam

;; org-agenda
(setq org-agenda-files (cons org-default-notes-file org-cabinets)) ;; populate agenda from cabinets + refile.org
(setq org-agenda-skip-scheduled-if-deadline-is-shown t) ;; show only deadline on or after day deadlining task is scheduled
(setq org-agenda-span 'week) ;; show week view by default
(setq org-agenda-start-day "-0d") ;; start at today by default (in org-read-date input form)
(setq org-agenda-start-on-weekday nil) ;; weekly overview starts today and looks forward, leave the past be.
;; tags/TODO filters (see tag and property searches) for agenda organization:
(setq org-stuck-projects 
      '("+LEVEL=1+TODO/-DONE-CANCELED-INACTIVE-NEXT" ("NEXT")))
;; Use the current window for indirect buffer display
(setq org-indirect-buffer-display 'current-window)

(setq org-columns-default-format
      "%TODO %2PRIORITY %25ITEM(Task) %10Effort(Est_Effort){est+} %CLOCKSUM %CLOCKSUM_T")
(org-clock-persistence-insinuate) ;; set up hooks for clock persistence through sessions
(setq org-clock-persist t) ;; continue any running clock when emacs exits. Also save all set clock history accross sessions.
(setq org-clock-idle-time 10) ;; and prompt to resolve running clocks when restarting, or after 10 minutes of emacs idle time.

(setq org-capture-templates
      (quote (("p" "project outlining and reporting") ;; new project definitions and reports on predefined projects
	      ("pt" "todo" entry (file "~/org/refile.org") ;; a new task needing to be defined and inserted into ongoing project
	       "* TODO %?\n%U\n%a\n")
	      ("ps" "todo" entry (file "~/org/refile.org") ;; schedule a new event.
	       "* TODO %?\n%^T")
	      ;; template current time, link in ring (or current file), capture new task name, pause other clocks, clock time, resume other clocks
	      ;; ex :: good for a job in any given piece of code because it links to the line that inspired it.
	      ;;		("pr" "reflect" entry (file "~/org/refile.org")
	      ;;		 "* JOURNAL")
	      ;; OR
	      ;;		("n" "note" entry (file "~/org/refile.org")
	      ;;               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
	      ;; not sure what this looks like yet. On-the-clock thoughts about current work (look at %k), look at organizing by :tag
	      ("i" "interruptions")
	      ("ir" "respond" entry (file "~/org/refile.org")
	       "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
	      ;; fully automated reaction cache for differed inquiries, requests, solicitations, etc.
	      ("ii" "idea" entry (file "~/org/refile.org")
	       "* INACTIVE")
	      ;; for academic questions, topics of investigation, project proposals, paper subject.
	      ;;		("w" "org-protocol" entry (file "~/org/refile.org")
	      ;;		 "* TODO Review %c\n%U\n" :immediate-finish t)
	      ;; tracking org workflow and planning adaptations TAG = :ENV?
	      ("m" "Meeting" entry (file "~/org/refile.org")
	       "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
	      ;; documenting essentials of scheduled and spontaneous meetings/encounters.
	      ("c" "CONTACT" entry (file "~/org/refile.org") ;; document professional contact
	       "* CONTACT"))))
(defun pm/remove-empty-drawer-on-clock-out ()
  "Remove empty STATUSLOG drawers on clock out, use as hook to de-clutter ephemeral captures"
  (interactive)
  (save-excursion
    (beginning-of-line 0)
    (org-remove-empty-drawer-at "STATUSLOG" (point))))
(add-hook 'org-clock-out-hook 'pm/remove-empty-drawer-on-clock-out 'append)

;; refile targets include any file contributing to the agenda - up to 9 levels deep
(setq org-refile-targets '((org-agenda-files :maxlevel . 9)))
;; Use full outline paths for refile targets - file directly into agenda position using Ivy
(setq org-refile-use-outline-path t)
;; Targets complete directly with Ivy, org need not assist
(setq org-outline-path-complete-in-steps nil)
;; Allow refile to create parent tasks with confirmation
(setq org-refile-allow-creating-parent-nodes 'confirm)
(defun pm/verify-refile-target ()
  "Exclude todo keywords with a done state from refile targets"
(not (member (nth 4 (org-heading-components)) org-done-keywords)))
(setq org-refile-target-verify-function 'pm/verify-refile-target)
