emacs/litinit.org
*** INACTIVE Org-Ref
;; org-ref for manuscripting -- see this in action first -- it seems
;; to want to centralize the library -- sensible
;; org-roam-bibtex might be a more suitable workflow

;; In either case, ivy-bibtex must also be installed and fully configured

;; (use-package org-ref
;;   :ensure t
;;   :config
;;   (setq reftex-default-bibliography '("~/org/bibliography/references.bib"))
;; 
;;   ;; see org-ref for use of these variables
;;   (setq org-ref-bibliography-notes "~/org/bibliography/notes.org"
;; 	org-ref-default-bibliography '("~/org/bibliography/references.bib")
;; 	org-ref-pdf-directory "~/Dropbox/bibliography/bibtex-pdfs/")
;;   (setq bibtex-completion-bibliography "~/Dropbox/bibliography/references.bib"
;; 	bibtex-completion-library-path "~/Dropbox/bibliography/bibtex-pdfs"
;; 	bibtex-completion-notes-path "~/Dropbox/bibliography/bibtex-notes"))    
*** TODO Org-Attachment
    :PROPERTIES:
    :ID:       431674a9-2ff1-40f7-994f-6cc2a7ee1e88
    :END:
    #+begin_src emacs-lisp
      (setq org-id-link-to-org-use-id t) ;; always make unique id for attachments
    #+end_src
**** TODO manage attachment directories
***** where to keep downloads?
***** screenshots?
***** latex previews?
*** TODO Org-Babel
    :PROPERTIES:
    :ID:       b9ef07e9-a022-4c1f-a75d-1336bd88fa07
    :END:
    #+begin_src emacs-lisp
      (add-to-list 'org-babel-load-languages '(python . t))
      (setq org-confirm-babel-evaluate nil)
    #+end_src
    use babel for jupyter notebooks? ein?
*** TODO Org for manuscripting
    :PROPERTIES:
    :ID:       2de99c61-a580-4a3c-aa5c-bf1b322b9c97
    :END:
    #+begin_src emacs-lisp
      (setq org-latex-pdf-process (list "latexmk -pdflatex='lualatex -shell-escape -interaction nonstopmode' -pdf -f %f"))
      (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))
    #+end_src
    LaTeX exporter setting and in-line math formula display preferences
**** TODO configure exporter to handle bibtex as well
** TODO Org Key Bindings)
   :PROPERTIES:
   :ID:       7dea4263-0b4d-4b69-8e6c-6cc11752281e
   :END:
   #+begin_src emacs-lisp
     :bind (("C-c l" . org-store-link) ;; global organization bindings
	    ("C-c a" . org-agenda) 
	    ("C-c c" . org-capture))) 
   #+end_src
   C-c is the conventional org mode command prefix. More specific sub modes and more general global modes should adopt philosophically consistent standards
* TODO Org-tempo
  :PROPERTIES:
  :ID:       06bdd462-539c-42fa-bf92-94a2271a2d12
  :END:
  #+begin_src emacs-lisp
    (use-package org-tempo ;; builtin
      :config
      (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
      (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
      (add-to-list 'org-structure-template-alist '("py" . "src python"))
      :bind (:map org-mode-map (("C-c C-," . org-insert-structure-template))))
  #+end_src
  makes literate programing in org a little easier
* TODO Org-Roam
  :PROPERTIES:
  :ID:       2a399e4a-0f14-4a33-a23f-67028014fb5d
  :END:
  #+begin_src emacs-lisp
    (use-package org-roam
      :ensure t
      :init (setq org-roam-v2-ack t) ;; Acknowledge no return to v1
      :custom
      ;; roam database for focused zettlekasten
      (org-roam-directory (file-truename (concat org-directory "/zettles")))
      :bind (("C-c n f" . org-roam-node-find)
	     ("C-c n g" . org-roam-graph)
	     ("C-c n r" . org-roam-node-random)		    
	     (:map org-mode-map
		   (("C-c n i" . org-roam-node-insert)
		    ("C-c n o" . org-id-get-create)
		    ("C-c n t" . org-roam-tag-add)
		    ("C-c n a" . org-roam-alias-add)
		    ("C-c n l" . org-roam-buffer-toggle))))
      :config
      (org-roam-db-autosync-mode)
      (require 'org-roam-protocol))
   #+end_src
** TODO org-roam-protocol
   find out what this is
* TODO org-download
  :PROPERTIES:
  :ID:       5ecc8d01-150a-46f9-a9b8-83f3cd1fd6c5
  :END:
  #+begin_src emacs-lisp
    (use-package org-download
      :ensure t
      :config
      (setq org-download-screenshot-method "flameshot gui --raw > %s"))
  #+end_src
  Provides integration between org attachment machinery and system's screen capture utility.
  awesome tool for note taking.
** TODO better organize where figures captured in notes are kept.
   Objective: figures taken and contextualized in notes should be readily available for linking into manuscripts, backing-up, etc.
   linking is easy as long as the note containing the figure can be found... It is *critical* to be able to rediscover notes on demand.
* TODO ivy and friends
  :PROPERTIES:
  :ID:       2780bde7-52be-4524-af10-bbf9f8bff9dc
  :END:
  #+begin_src emacs-lisp
    (use-package ivy
      :ensure t
      :init
      (ivy-mode 1)
      :bind (:map ivy-minibuffer-map
		  ("TAB" . ivy-partial)))
    (use-package ivy-yasnippet
      :ensure t
      :bind ("C-c y" . ivy-yasnippet)) ;; look into refining this and ensure consistency with bind logic
  #+end_src
  ivy is a completion framework with speed dial. Offers ability to execute actions on selected items on the fly.
  has a lot of integration with other modes
** TODO What is Counsel? Swiper?
* TODO global minor modes
  :PROPERTIES:
  :ID:       1d70d5db-5bc9-4f6e-997b-6d91c4c0ea40
  :END:
  #+begin_src emacs-lisp
	(use-package yasnippet ;; extensible codeblock insertion utility
	  :ensure t
	  :config
	  (yas-minor-mode 1))
	(use-package wucuo ;; use hunspell spell checker
	  :ensure t
	  :config
	  (add-hook 'prog-mode-hook 'wucuo-start)
	  (add-hook 'text-mode-hook 'wucuo-start))
	;;(use-package undo-fu (define-key undo-fu-mode-map (kbd "C-?") #'undo-fu-only-redo))
  #+end_src
** TODO keybinds
   :PROPERTIES:
   :ID:       c1e4c0c0-bc84-482f-8152-05c47909214a
   :END:
   #+begin_src emacs-lisp
     (setq bindlist '((windmove-swap-states-right "C-M-s-f" "C-M-s-<right>")
		      (windmove-swap-states-up "C-M-s-p" "C-M-s-<up>")
		      (windmove-swap-states-left "C-M-s-b" "C-M-s-<left>")
		      (windmove-swap-states-down "C-M-s-n" "C-M-s-<down>")
		      (windmove-right "C-s-f" "C-s-<right>")
		      (windmove-up "C-s-p" "C-s-<up>")
		      (windmove-left "C-s-b" "C-s-<left>")
		      (windmove-down "C-s-n" "C-s-<down>")
		      ;;                 (spell-fu-goto-next-error "C-,")
		      ;;                 (+spell/correct "C-.")
		      (backward-delete-char-untabify "C-S-d")))
      
     (dolist (bind-to bindlist)
       (let ((keys (cdr bind-to)))
	 (dolist (key keys)
	   (define-key (current-global-map) (kbd key) (car bind-to)))))
      
     ;; minimize window just freezes it in dwm -- not nice
     ;;(unbind-key "C-z")
     ;;(unbind-key "C-x C-z")
   #+end_src
   these keybindings are specifically for windmove, anything else? or deal with these usign a use package declaration?
   what's the advantage here?
** TODO ibuffer integration with perspective and projectile
   persp-ibuffer should be able to limit view of buffers in ibuffer to those of the current perspective
   Within this, the ibuffer-projectile package should be able to group buffers by project root...
** TODO ibuffer discover bindings
   discover my major? get similar effect to discover for dired. See the available commands.
* TODO Image and PDF viewing
  :PROPERTIES:
  :ID:       77c9fdea-b27c-497e-acb2-85d1c942ba86
  :END:
  #+begin_src emacs-lisp
    (use-package pdf-tools
      :ensure t) ;;seems to take care of turning itself on
  #+end_src
  pdf-tools PDFview outperforms docview. occasionally requires recompilation (M-x pdf-tools install)
* TODO Extending Fundamental Functionality
** TODO Perspective
   :PROPERTIES:
   :ID:       9f82beed-818b-4e68-924b-224b3e3c9a83
   :END:
   #+begin_src emacs-lisp
     (use-package perspective
       :ensure t
       :init
       (persp-mode)  
       (setq persp-initial-frame-name 'Prime)
       :config
       (add-hook 'after-init-hook (lambda () (persp-state-load "~/.config/emacs/perspectives/Agenda"))) ;; load todos, switch to agenda perspective on startup
       (add-hook 'persp-state-after-load-hook (lambda () (when (equal (persp-current-name) "Agenda")
							   (org-agenda-list)))) ;; show todos by opening Agenda
       (require 'ibuffer)
       :bind (("C-x C-b" . persp-ibuffer) ;; this doesn't seem to be working nicely, shows too much
	      ("C-x b" . persp-ivy-switch-buffer)
	      ("C-x k" . persp-kill-buffer*)))
   #+end_src
*** TODO set up default list of open perspectives
    on startup, show comprehensive agenda and offer interface for opening/building perspectives
** TODO Discoverablity
   :PROPERTIES:
   :ID:       2f56a136-3572-4341-a307-5081357ff31b
   :END:
   #+begin_src emacs-lisp
     (use-package which-key
       :init
       (setq which-key-sort-order #'which-key-key-order-alpha
	     which-key-sort-uppercase-first nil
	     which-key-add-column-padding 1
	     which-key-max-display-columns nil
	     which-key-min-display-lines 6
	     which-key-side-window-slot -10)
       :config
       ;; general improvements to which-key readability
       (which-key-setup-side-window-bottom)
       (which-key-mode 1))
   #+end_src
   Provides on-the-fly navigation of key hierarchies.
*** TODO use which-key as navigator for hydras? or replace which-key with hydra navigator?
* TODO Integrated Development Environment
** TODO LSP protocol integration
** TODO Company Back-ends and Virtual Environment Integration
*** TODO Python
    :PROPERTIES:
    :ID:       12165476-71a2-4170-ae11-4f9c10337935
    :END:
    #+begin_src emacs-lisp
      (defun python-setup ()
	"Sets company backends"
	(interactive)
	;; (setq company-backends '(company-matlab-shell))
	(company-mode 1))
       
      (use-package python
	:ensure t
	:config
	(add-hook 'python-mode-hook 'python-setup))
       
      (use-package conda
	:ensure t
	:config
	(setq conda-env-home-directory "/opt/miniconda3") ;;conda is root...
	;;get current environment--from environment variable CONDA_DEFAULT_ENV
	(setq conda-anaconda-home "/opt/miniconda3")
	;; (conda-env-activate (getenv "CONDA_DEFAULT_ENV")) ;; default to (base) or whetever is set
	(conda-env-autoactivate-mode t) ;;useful for python projects
	(conda-env-initialize-interactive-shells)
	(setq-default mode-line-format (cons '(:exec conda-env-current-name) mode-line-format))
	;;  (setq eshell-prompt-function ;; customizes the eshell prompt -- here because it includes the env
	;;        (lambda ()
	;;          (concat conda-env-current-name
	;;                  (getenv "USER") "@"
	;;                  (car (split-string (getenv "HOSTNAME") "[.]"))
	;;                  (if (= (user-uid) 0) " # " " $ ")))))
	)
    #+end_src
**** TODO set conda default env properly
**** TODO use conda environment selectively
     activate when python mode/shell is activated
