emacs/init.el

(setq org-id-link-to-org-use-id t) ;; always make unique id for attachments

(add-to-list 'org-babel-load-languages '(python . t))
(setq org-confirm-babel-evaluate nil)

(setq org-latex-pdf-process (list "latexmk -pdflatex='lualatex -shell-escape -interaction nonstopmode' -pdf -f %f"))
(setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))

:bind (("C-c l" . org-store-link) ;; global organization bindings
       ("C-c a" . org-agenda) 
       ("C-c c" . org-capture)))

(use-package org-tempo ;; builtin
  :config
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  :bind (:map org-mode-map (("C-c C-," . org-insert-structure-template))))

(use-package org-roam
  :ensure t
  :init (setq org-roam-v2-ack t) ;; Acknowledge no return to v1
  :custom
  ;; roam database for focused zettlekasten
  (org-roam-directory (file-truename (concat org-directory "/zettles")))
  :bind (("C-c n f" . org-roam-node-find)
	 ("C-c n g" . org-roam-graph)
	 ("C-c n r" . org-roam-node-random)		    
	 (:map org-mode-map
	       (("C-c n i" . org-roam-node-insert)
		("C-c n o" . org-id-get-create)
		("C-c n t" . org-roam-tag-add)
		("C-c n a" . org-roam-alias-add)
		("C-c n l" . org-roam-buffer-toggle))))
  :config
  (org-roam-db-autosync-mode)
  (require 'org-roam-protocol))

(use-package org-download
  :ensure t
  :config
  (setq org-download-screenshot-method "flameshot gui --raw > %s"))

(use-package ivy
  :ensure t
  :init
  (ivy-mode 1)
  :bind (:map ivy-minibuffer-map
	      ("TAB" . ivy-partial)))
(use-package ivy-yasnippet
  :ensure t
  :bind ("C-c y" . ivy-yasnippet)) ;; look into refining this and ensure consistency with bind logic

(use-package yasnippet ;; extensible codeblock insertion utility
  :ensure t
  :config
  (yas-minor-mode 1))
(use-package wucuo ;; use hunspell spell checker
  :ensure t
  :config
  (add-hook 'prog-mode-hook 'wucuo-start)
  (add-hook 'text-mode-hook 'wucuo-start))
;;(use-package undo-fu (define-key undo-fu-mode-map (kbd "C-?") #'undo-fu-only-redo))

(setq bindlist '((windmove-swap-states-right "C-M-s-f" "C-M-s-<right>")
		 (windmove-swap-states-up "C-M-s-p" "C-M-s-<up>")
		 (windmove-swap-states-left "C-M-s-b" "C-M-s-<left>")
		 (windmove-swap-states-down "C-M-s-n" "C-M-s-<down>")
		 (windmove-right "C-s-f" "C-s-<right>")
		 (windmove-up "C-s-p" "C-s-<up>")
		 (windmove-left "C-s-b" "C-s-<left>")
		 (windmove-down "C-s-n" "C-s-<down>")
		 ;;                 (spell-fu-goto-next-error "C-,")
		 ;;                 (+spell/correct "C-.")
		 (backward-delete-char-untabify "C-S-d")))

(dolist (bind-to bindlist)
  (let ((keys (cdr bind-to)))
    (dolist (key keys)
      (define-key (current-global-map) (kbd key) (car bind-to)))))

;; minimize window just freezes it in dwm -- not nice
;;(unbind-key "C-z")
;;(unbind-key "C-x C-z")

(use-package pdf-tools
  :ensure t) ;;seems to take care of turning itself on

(use-package perspective
  :ensure t
  :init
  (persp-mode)  
  (setq persp-initial-frame-name 'Prime)
  :config
  (add-hook 'after-init-hook (lambda () (persp-state-load "~/.config/emacs/perspectives/Agenda"))) ;; load todos, switch to agenda perspective on startup
  (add-hook 'persp-state-after-load-hook (lambda () (when (equal (persp-current-name) "Agenda")
						      (org-agenda-list)))) ;; show todos by opening Agenda
  (require 'ibuffer)
  :bind (("C-x C-b" . persp-ibuffer) ;; this doesn't seem to be working nicely, shows too much
	 ("C-x b" . persp-ivy-switch-buffer)
	 ("C-x k" . persp-kill-buffer*)))

(use-package which-key
  :init
  (setq which-key-sort-order #'which-key-key-order-alpha
	which-key-sort-uppercase-first nil
	which-key-add-column-padding 1
	which-key-max-display-columns nil
	which-key-min-display-lines 6
	which-key-side-window-slot -10)
  :config
  ;; general improvements to which-key readability
  (which-key-setup-side-window-bottom)
  (which-key-mode 1))

(defun python-setup ()
  "Sets company backends"
  (interactive)
  ;; (setq company-backends '(company-matlab-shell))
  (company-mode 1))

(use-package python
  :ensure t
  :config
  (add-hook 'python-mode-hook 'python-setup))

(use-package conda
  :ensure t
  :config
  (setq conda-env-home-directory "/opt/miniconda3") ;;conda is root...
  ;;get current environment--from environment variable CONDA_DEFAULT_ENV
  (setq conda-anaconda-home "/opt/miniconda3")
  ;; (conda-env-activate (getenv "CONDA_DEFAULT_ENV")) ;; default to (base) or whetever is set
  (conda-env-autoactivate-mode t) ;;useful for python projects
  (conda-env-initialize-interactive-shells)
  (setq-default mode-line-format (cons '(:exec conda-env-current-name) mode-line-format))
  ;;  (setq eshell-prompt-function ;; customizes the eshell prompt -- here because it includes the env
  ;;        (lambda ()
  ;;          (concat conda-env-current-name
  ;;                  (getenv "USER") "@"
  ;;                  (car (split-string (getenv "HOSTNAME") "[.]"))
  ;;                  (if (= (user-uid) 0) " # " " $ ")))))
  )
