emacs/litinit.org
* TODO Google-calendar integration
  :PROPERTIES:
  :ID:       14b1e902-d92e-4955-889a-453d1aafd43a
  :END:
  #+begin_src emacs-lisp
    ;; org agenda and calendar customization and automation
    ;;(defun my-open-calendar ()
    ;;  (interactive)
    ;;  (cfw:open-calendar-buffer
    ;;   :contents-sources
    ;;   (list
    ;;    (cfw:org-create-source "Green")  ; org-agenda source
    ;;    (cfw:org-create-file-source "cal" "/path/to/cal.org" "Cyan")  ; other org source
    ;;    (cfw:howm-create-source "Blue")  ; howm source
    ;;    (cfw:cal-create-source "Orange") ; diary source
    ;;    (cfw:ical-create-source "Moon" "~/moon.ics" "Gray")  ; ICS source1
    ;;    (cfw:ical-create-source "gcal" "https://..../basic.ics" "IndianRed") ; google calendar ICS
    ;;   )))
  #+end_src
  is this necessary considering the emphasis on org-capture based calendaring?
* Custom Utility Functions
  :PROPERTIES:
  :ID:       a909cafc-561b-471d-a157-dd57c0ed019e
  :END:
  #+begin_src emacs-lisp
    (defun smb-2-dee ()
      "smb remote connection to Uc's ceas1 domain clusterfsnew server"
      (interactive)
      (find-file "/smb:manganpt%ceas1@clusterfsnew.ceas1.uc.edu:/DEE/"))
     
    (defun copy-file-to-tmp (file)
      "delegate for dired-open-remote-tmpfile"
      (copy-file file "/tmp/" 1)
      (let* ((extension (file-name-extension file))
	     (base (file-name-base file)))
	(format "/tmp/%s.%s" base extension)))
     
    (defun dired-open-remote-tmpfile (localprog)
      "copies file in remote dired to local tmp, opens with local program, and returns modified file to remote dired"
      (interactive "sLocal Program Name: ")
      (let* ((remote-file (dired-filename-at-point))
	     (tmpfile (copy-file-to-tmp remote-file)))
	(async-start-process localprog
			     localprog
			     (lambda (process-obj)
			       "move tmpfile back to remote directory"
			       (copy-file tmpfile remote-file 1))
			     tmpfile)))
  #+end_src
** TODO dired-open-remote-tmpfile
   use dmenu or make it work with ivy and council linux apps?
* Saved Keymacros
  :PROPERTIES:
  :ID:       7fad8dd6-624d-4dc0-8886-ea2ca553c673
  :END:
  #+begin_src emacs-lisp
    (fset 'pm/org-clone-3d-subtree-with-1w-timeshift
	  (kmacro-lambda-form [?\C-c ?\C-x ?c ?1 return ?+ ?1 ?w return ?\C-c ?\C-n M-down M-down ?\C-c ?\C-p ?\C-c ?\C-p ?\C-c ?\C-x ?c ?1 return ?+ ?1 ?w return ?\C-c ?\C-n M-down M-down ?\C-c ?\C-p ?\C-c ?\C-p ?\C-c ?\C-x ?c ?1 return ?+ ?1 ?w return ?\C-c ?\C-n M-down M-down ?\C-c ?\C-p ?\C-c ?\C-p] 0 "%d"))
    (fset 'pm/org-clone-2d-subtree-with-1w-timeshift
	  (kmacro-lambda-form [?\C-c ?\C-x ?c ?1 return ?+ ?1 ?w return ?\C-c ?\C-n M-down ?\C-c ?\C-p ?\C-c ?\C-x ?c ?1 return ?+ ?1 ?w return ?\C-c ?\C-n M-down ?\C-c ?\C-p] 0 "%d"))
  #+end_src
  Org agenda scheduling keymacros
